Revit 2026 API

# PlanTopologySetErase Method

---

Removes a specified object from the set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	PlanTopology item
)
```
```vb
Public Overridable Function Erase (
	item As PlanTopology
) As Integer
```
```cpp
public:
virtual int Erase(
	PlanTopology^ item
)
```
```fsharp
abstract Erase :
        item : PlanTopology -> int
override Erase :
        item : PlanTopology -> int
```

#### Parameters

item PlanTopology
    The item to be erased.

#### Return Value

Int32The number of items that were erased from the set.

#### Reference

PlanTopologySet Class

Autodesk.Revit.DB Namespace